from utils import WordReportBuilder
import os
import warnings
import re
warnings.filterwarnings("ignore", category=UserWarning, module="docx")

def add_listings_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    listingsNumber = 0

    code_extensions = {
        '.c', '.cpp', '.h', '.py', '.java', '.js', '.ts', '.rb', '.go', '.php', 
        '.html', '.css', '.sh', '.pl', '.swift', '.kt', '.scala', '.r', '.lua', 
        '.m', '.sql', '.bash'
    }

    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and any(file_name.lower().endswith(ext) for ext in code_extensions):
                try:
                    with open(file_path, 'r', encoding='utf-8') as f:
                        code = f.read()
                    
                    listingsNumber += 1
                    report.add_listing(f"Лістинг {lr_number}.{listingsNumber} – Вміст {file_name}", code)
                except Exception as e:
                    print(f"Ошибка при обработке файла {file_name}: {e}")

def add_images_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    imagesNumber = 0

    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and file_path.lower().endswith(('.png', '.jpg', '.jpeg')):
                imagesNumber += 1

                report.append_text(f"Soooooomeeeee зображено на рисунку {lr_number}.{imagesNumber}.")
                report._add_blank_line()

                report.add_image(file_path, f"Рисунок {lr_number}.{imagesNumber} – Головне вікно програми")


if __name__ == "__main__":
    report = WordReportBuilder("Звіт.docx")
    
    report.add_section_title("ЛАБОРАТОРНА РОБОТА № 1")
    report.add_lab_topic("Комп’ютерна система бухгалтерського обліку.")
    report.add_lab_goal("Мета: ознайомитись з інформаційною системою  MASTER:Бухгалтерія.")
    
    report.add_lab_process("Постановка завдання")
    report.add_list(
    "Підготовка звітного документа:",
        """
Створіть файл у Microsoft Word із іменем за шаблоном: лр_№_назва дисципліни_прізвище_група (де «№» – номер лабораторної роботи, «назва дисципліни» – назва курсу, «прізвище» та «група» – відповідно прізвище студента та номер групи).
На кожну виконану дію робіть скріншот, який буде додано до звіту. Рисунки нумеруйте відповідно до номера лабораторної роботи (наприклад, для ЛР1 – 1.1, 1.2, …; для ЛР2 – 2.1, 2.2, …).
    """
    )

    report.add_list(
        "Запуск демо-версії MASTER:Бухгалтерія:",
        """
За посиланням, розміщеним у курсі дисципліни, відкрийте демо-версію програми.
На екрані входу виберіть посаду «Головний бухгалтер». Поле для паролю залиште порожнім.
Натисніть кнопку «Увійти» і зробіть скріншот отриманого екрану (Рисунок 1 – Вхід в систему).
        """
    )

    report.add_list(
        "Вибір об’єкта обліку:",
        """
Після входу виберіть будь-який об’єкт з переліку та натисніть кнопку «ВИБРАТИ».
Зафіксуйте цей крок скріншотом (Рисунок 2 – Вибір об’єкта).
        """
    )

    report.add_list(
        "Додавання нового контрагента (власної організації):",
        """
Перейдіть до модуля «Довідники» → розділ «Продажі і покупки» → пункт меню «Контрагенти». (Скріншот – Рисунок 3 – Модуль Довідники).
У вікні пошуку контрагентів натисніть кнопку «ОК», залишаючи поля форми порожніми, щоб створити нового контрагента. (Скріншот – Рисунок 4 – Вікно пошуку контрагентів).
Перейдіть до вкладки «Довідник організацій» та натисніть кнопку «Додати» (або використайте клавішу F7). Якщо кнопка не відображається на панелі інструментів, скористайтеся значком «три крапки» у верхньому правому куті вкладки та оберіть відповідний пункт меню. (Скріншот – Рисунок 5 – Довідник організацій).
        """
    )

    report.add_list(
        "Заповнення екранної форми для нового контрагента:",
        """
Відкриється екранна форма для внесення даних. Заповніть її вручну, звертаючи увагу, що в полі «Назва підприємства» необхідно вказати власне прізвище студента (наприклад, ТОВ «ПРЕМЄР ПЛЮС [ПРІЗВИЩЕ СТУДЕНТА]»).
У вкладці «Реквізити» заповніть наступні поля:
    Найменування скорочене: ТОВ «ПРЕМЄР ПЛЮС [ПРІЗВИЩЕ СТУДЕНТА]»
    Найменування повне: ТОВ «ПРЕМЄР ПЛЮС [ПРІЗВИЩЕ СТУДЕНТА]»
    Повне найменування для документів: (рекомендується використовувати ту ж назву, що зазначена у статуті)
    Період дії (за потреби)
    Ознака юридичної/фізичної особи
    Найменування головної організації та № філії (при створенні ієрархічної структури)
    Код ЄДРПОУ: 32770087
    Код ІПН: 327700826520
    Ознака платника ПДВ
    Ознака статусу платника податку на прибуток
    Свідоцтво платника ПДВ
    Ознака платника акцизного податку
    Найменування податкової інспекції (вибір з довідника)
    Місто: вибрати зі списку (за допомогою клавіші F10, вказати місто студента)
    Адреса: ввести вручну (домашня адреса студента)
    Країна, Область: підставляються автоматично відповідно до вибраного міста
    Об’єкти: за замовчуванням налаштовуються для всіх об’єктів, якщо значення не вказано
Якщо при введенні значень у поля ЄДРПОУ чи ІПН з’являється повідомлення про помилку (невірний код або запис уже існує), встановіть прапорець «Не включений до ЄДРПОУ».
Зафіксуйте заповнення форми скріншотом (Рисунок 6 – Заповнення реквізитів).
        """
    )

    report.add_list(
        "Збереження даних:",
        """
Після заповнення форми натисніть кнопку «Додати» для збереження реєстраційних даних.
Переконайтесь, що новий контрагент (власна організація) з’явився у довіднику. (Скріншот – Рисунок 7 – Результат додавання нового контрагента).
        """
    )

    report.add_list(
        "Фінальні вимоги:",
        """
Підготовлений звіт потрібно зберегти у форматі PDF.
Завдання захищається на занятті із демонстрацією виконаних дій на екрані.
        """
    )


    report.add_list(
        "Критерії оцінювання:",
        """
Виконання всіх кроків: Всі зазначені дії мають бути виконані згідно з алгоритмом.
Якість оформлення звіту: Наявність всіх необхідних скріншотів із правильною нумерацією, відповідність оформлення звіту вимогам.
Коректність заповнення даних: Дані в екранних формах повинні бути заповнені відповідно до інструкції.
Демонстрація виконання: Вміння оперативно показати виконані дії під час захисту роботи.
        """
    )

    lr_number = 1
    report.add_lab_process("Хід роботи")

    add_images_of_all_files(report, lr_number, "photo")

    report.add_lab_conclusion("Висновок: ознайомився з інформаційною системою  MASTER:Бухгалтерія.")
    report.save()
