from utils import WordReportBuilder
import os
import warnings
import re
warnings.filterwarnings("ignore", category=UserWarning, module="docx")

def add_listings_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    listingsNumber = 0

    # Список расширений файлов программного кода
    code_extensions = {
        '.c', '.cpp', '.h', '.py', '.java', '.js', '.ts', '.rb', '.go', '.php', 
        '.html', '.css', '.sh', '.pl', '.swift', '.kt', '.scala', '.r', '.lua', 
        '.m', '.sql', '.bash'
    }

    # Используем os.walk для рекурсивного обхода всех файлов в подкаталогах
    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and any(file_name.lower().endswith(ext) for ext in code_extensions):
                try:
                    with open(file_path, 'r', encoding='utf-8') as f:
                        code = f.read()
                    
                    listingsNumber += 1
                    report.add_listing(f"Лістинг {lr_number}.{listingsNumber} – Вміст {file_name}", code)
                except Exception as e:
                    print(f"Ошибка при обработке файла {file_name}: {e}")

def add_images_of_all_files(report, lr_number, path):
    if not os.path.isdir(path):
        raise ValueError(f"{path} не является директорией.")

    imagesNumber = 0

    # Используем os.walk для рекурсивного обхода всех файлов в подкаталогах
    for root, dirs, files in os.walk(path):
        for file_name in files:
            file_path = os.path.join(root, file_name)

            if os.path.isfile(file_path) and file_path.lower().endswith(('.png', '.jpg', '.jpeg')):
                imagesNumber += 1

                report.append_text(f"Soooooomeeeee зображено на рисунку {lr_number}.{imagesNumber}.")
                report._add_blank_line()

                report.add_image(file_path, f"Рисунок {lr_number}.{imagesNumber} – Головне вікно програми")


if __name__ == "__main__":
    report = WordReportBuilder("Звіт.docx")
    
    report.add_section_title("ЛАБОРАТОРНА РОБОТА № 1")
    report.add_lab_topic("Виявлення якісних особливостей та  комунікативних і організаторських схильностей.")
    report.add_lab_goal("Мета: навчитись особистості виявляти комунікативні та організаторські схильності.")
    
    report.add_lab_process("Постановка завдання")
    report.append_text("""Пройти тест, який допоможе виявити комунікативні та організаторські здібності. Ці навички є ключовими для професій, що передбачають активну взаємодію з іншими людьми. Успіх у таких сферах діяльності, як керівництво колективами, навчання, виховання, культурно-просвітницька діяльність та побутове обслуговування, значною мірою залежить від вашої здатності ефективно спілкуватися та організовувати роботу. Відповіді на питання тесту дозволять виявити якісні особливості комунікативних і організаторських схильностей, що допоможе вам краще зрозуміти свої сильні сторони та можливості для розвитку в обраній професії.""")
    report._add_blank_line()

    lr_number = 1
    report.add_lab_process("Хід роботи")
    report.append_text("Прочитаємо інструкцію та ознайомимося з умовами тестування. Пройдемо тест, відповідаючи на кожне питання, ставлячи відповідно 'так' або 'ні' навпроти кожного з них.")
    report._add_blank_line()

    data = [
        ['1', 'Чи багато у Вас друзів, з якими Ви постійно спілкуєтеся? ', 'ні'],
        ['2', 'Чи часто Вам вдається схилити більшість своїх товаришів до прийняття ними Вашої думки? ', 'так'],
        ['3', 'Чи довго Вас турбує почуття образи, заподіяне Вам кимось з Ваших товаришів? ', 'ні'],
        ['4', 'Чи завжди Вам важко орієнтуватися в критичній ситуації, що створилася? ', 'ні'],
        ['5', 'Чи є у Вас прагнення до встановлення нових знайомств з різними людьми? ', 'так'],
        ['6', 'Чи подобається Вам займатися громадською роботою? ', 'так'],
        ['7', 'Чи вірно, що Вам приємніше і простіше проводити час з книгами або за яким-небудь іншим заняттям, ніж з людьми? ', 'ні'],
        ['8', 'Якщо виникли які-небудь перешкоди в здійсненні Ваших намірів, то чи легко Ви відступаєте від них? ', 'ні'],
        ['9', 'Чи легко Ви встановлюєте контакти з людьми, які значно старші за Вас за віком? ', 'так'],
        ['10', 'Чи любите Ви придумувати і організовувати зі своїми товаришами різні ігри і розваги? ', 'так'],
        ['11', 'Чи важко Ви включаєтеся у нову для Вас компанію? ', 'ні'],
        ['12', 'Чи часто Ви відкладаєте на інші дні ті справи, які треба було б виконати сьогодні? ', 'так'],
        ['13', 'Чи легко Вам вдається встановлювати контакти з незнайомими людьми? ', 'так'],
        ['14', 'Чи прагнете Ви домагатися, щоб Ваші товариші діяли відповідно до Вашої думки? ', 'ні'],
        ['15', 'Чи важко Ви освоюєтеся в новому колективі? ', 'ні'],
        ['16', 'Чи вірно, що у Вас не буває конфліктів з товаришами через невиконання ними своїх обов’язків, зобов’язань? ', 'так'],
        ['17', 'Чи прагнете Ви при слушній нагоді познайомитися і поговорити з новою людиною? ', 'так'],
        ['18', 'Чи часто в рішенні важливих справ Ви переймаєте ініціативу на себе? ', 'так'],
        ['19', 'Чи дратують Вас навколишні люди і чи хочеться Вам побути одному? ', 'ні'],
        ['20', 'Чи правда, що Ви зазвичай погано орієнтуєтеся в незнайомій для Вас обстановці? ', 'ні'],
        ['21', 'Чи подобається Вам постійно знаходитися серед людей? ', 'так'],
        ['22', 'Чи виникає у Вас роздратування, якщо Вам не вдається закінчити почату справу? ', 'ні'],
        ['23', 'Чи переживаєте Ви почуття утруднення, незручності або ніяковості, якщо доводиться виявити ініціативу, щоб познайомитися з новою людиною? ', 'ні'],
        ['24', 'Чи правда, що Ви стомлюєтеся від частого спілкування з товаришами? ', 'ні'],
        ['25', 'Чи любите Ви брати участь в колективних іграх? ', 'так'],
        ['26', 'Чи часто Ви проявляєте ініціативу при вирішенні питань, що зачіпають інтереси Ваших товаришів? ', 'так'],
        ['27', 'Чи правда, що Ви почуваєте себе невпевнено серед малознайомих Вам людей? ', 'ні'],
        ['28', 'Чи вірно, що Ви рідко прагнете до доказу своєї правоти? ', 'так'],
        ['29', 'Чи вважаєте Ви, що Вам не доставляє особливої важкості внести пожвавлення до малознайомої Вам компанії? ', 'так'],
        ['30', 'Чи приймаєте Ви участь в громадській роботі університету? ', 'ні'],
        ['31', 'Чи прагнете Ви обмежити коло своїх знайомих невеликою кількістю людей? ', 'ні'],
        ['32', 'Чи вірно, що Ви не прагнете обстоювати свою думку або рішення, якщо воно не було відразу прийняте Вашими товаришами? ', 'ні'],
        ['33', 'Чи відчуваєте Ви себе невимушено, потрапивши в незнайому Вам компанію? ', 'так'],
        ['34', 'Чи охоче Ви приступаєте до організації різних заходів для своїх товаришів? ', 'так'],
        ['35', 'Чи правда, що Ви не почуваєте себе досить упевненим і спокійним, коли доводиться говорити що-небудь великій групі людей? ', 'ні'],
        ['36', 'Чи часто Ви спізнюєтеся на ділові зустрічі, побачення? ', 'ні'],
        ['37', 'Чи Вірно, що у Вас багато друзів? ', 'так'],
        ['38', 'Чи часто Ви бентежитеся, відчуваєте незручність при спілкуванні з малознайомими людьми? ', 'ні'],
        ['39', 'Чи правда, що Вас лякає перспектива виявитися в новому колективі? ', 'ні'],
        ['40', 'Чи правда, що Ви не дуже упевнено почуваєте себе в оточенні великої групи своїх товаришів? ', 'ні'],
    ]

    description = "Таблица 1.1 – Відповіді на запитання тесту"

    report.add_table(description, data)  # Добавляем таблицу для раздела 1

    report.append_text("Підрахуємо кількість відповідей 'так' і 'ні' для аналізу результатів.")
    report._add_blank_line()


    data = [
        ['Номер', 'Питання', 'Очікувана відповідь', 'Надана відповідь', 'Співпадіння'],
        ['1',  'Чи багато у Вас друзів, з якими Ви постійно спілкуєтеся?',                             'так', 'ні', 'ні'],
        ['3',  'Чи довго Вас турбує почуття образи, заподіяне Вам кимось з Ваших товаришів?',            'ні', 'ні', 'так'],
        ['5',  'Чи є у Вас прагнення до встановлення нових знайомств з різними людьми?',                   'так', 'так', 'так'],
        ['7',  'Чи вірно, що Вам приємніше і простіше проводити час з книгами або за яким-небудь заняттям, ніж з людьми?', 'ні', 'ні', 'так'],
        ['9',  'Чи легко Ви встановлюєте контакти з людьми, які значно старші за Вас за віком?',          'так', 'так', 'так'],
        ['11', 'Чи важко Ви включаєтеся у нову для Вас компанію?',                                      'ні', 'ні', 'так'],
        ['13', 'Чи легко Вам вдається встановлювати контакти з незнайомими людьми?',                       'так', 'так', 'так'],
        ['15', 'Чи важко Ви освоюєтеся в новому колективі?',                                             'ні', 'ні', 'так'],
        ['17', 'Чи прагнете Ви при слушній нагоді познайомитися і поговорити з новою людиною?',            'так', 'так', 'так'],
        ['19', 'Чи дратують Вас навколишні люди і чи хочеться Вам побути одному?',                        'ні', 'ні', 'так'],
        ['21', 'Чи подобається Вам постійно знаходитися серед людей?',                                'так', 'так', 'так'],
        ['23', 'Чи переживаєте Ви почуття утруднення, незручності або ніяковості, якщо доводиться виявити ініціативу, щоб познайомитися з новою людиною?', 'ні', 'ні', 'так'],
        ['25', 'Чи любите Ви брати участь в колективних іграх?',                                        'так', 'так', 'так'],
        ['27', 'Чи правда, що Ви почуваєте себе невпевнено серед малознайомих Вам людей?',              'ні', 'ні', 'так'],
        ['29', 'Чи вважаєте Ви, що Вам не доставляє особливої важкості внести пожвавлення до малознайомої Вам компанії?', 'так', 'так', 'так'],
        ['31', 'Чи прагнете Ви обмежити коло своїх знайомих невеликою кількістю людей?',                'ні', 'ні', 'так'],
        ['33', 'Чи відчуваєте Ви себе невимушено, потрапивши в незнайому Вам компанію?',                  'так', 'так', 'так'],
        ['35', 'Чи правда, що Ви не почуваєте себе досить упевненим і спокійним, коли доводиться говорити що-небудь великій групі людей?', 'ні', 'ні', 'так'],
        ['37', 'Чи Вірно, що у Вас багато друзів?',                                                   'так', 'так', 'так'],
        ['39', 'Чи правда, що Вас лякає перспектива виявитися в новому колективі?',                        'ні', 'ні', 'так']
    ]

    description = "Таблица 1.2 – Результати комунікативної здібності"

    report.add_table(description, data)

    data = [
        ['Номер', 'Питання', 'Очікувана відповідь', 'Надана відповідь', 'Співпадіння'],
        ['2',  'Чи часто Вам вдається схилити більшість своїх товаришів до прийняття ними Вашої думки? ',
               'так', 'так', 'так'],
        ['4',  'Чи завжди Вам важко орієнтуватися в критичній ситуації, що створилася? ',
               'ні', 'ні', 'так'],
        ['6',  'Чи подобається Вам займатися громадською роботою? ',
               'так', 'так', 'так'],
        ['8',  'Якщо виникли які-небудь перешкоди в здійсненні Ваших намірів, то чи легко Ви відступаєте від них? ',
               'ні', 'ні', 'так'],
        ['10', 'Чи любите Ви придумувати і організовувати зі своїми товаришами різні ігри і розваги? ',
               'так', 'так', 'так'],
        ['12', 'Чи часто Ви відкладаєте на інші дні ті справи, які треба було б виконати сьогодні? ',
               'ні', 'так', 'ні'],
        ['14', 'Чи прагнете Ви домагатися, щоб Ваші товариші діяли відповідно до Вашої думки? ',
               'так', 'ні', 'ні'],
        ['16', 'Чи вірно, що у Вас не буває конфліктів з товаришами через невиконання ними своїх обов’язків, зобов’язань? ',
               'ні', 'так', 'ні'],
        ['18', 'Чи часто в рішенні важливих справ Ви переймаєте ініціативу на себе? ',
               'так', 'так', 'так'],
        ['20', 'Чи правда, що Ви зазвичай погано орієнтуєтеся в незнайомій для Вас обстановці? ',
               'ні', 'ні', 'так'],
        ['22', 'Чи виникає у Вас роздратування, якщо Вам не вдається закінчити почату справу? ',
               'так', 'ні', 'ні'],
        ['24', 'Чи правда, що Ви стомлюєтеся від частого спілкування з товаришами? ',
               'ні', 'ні', 'так'],
        ['26', 'Чи часто Ви проявляєте ініціативу при вирішенні питань, що зачіпають інтереси Ваших товаришів? ',
               'так', 'так', 'так'],
        ['28', 'Чи вірно, що Ви рідко прагнете до доказу своєї правоти? ',
               'ні', 'так', 'ні'],
        ['30', 'Чи приймаєте Ви участь в громадській роботі університету? ',
               'так', 'ні', 'ні'],
        ['32', 'Чи вірно, що Ви не прагнете обстоювати свою думку або рішення, якщо воно не було відразу прийняте Вашими товаришами? ',
               'ні', 'ні', 'так'],
        ['34', 'Чи охоче Ви приступаєте до організації різних заходів для своїх товаришів? ',
               'так', 'так', 'так'],
        ['36', 'Чи часто Ви спізнюєтеся на ділові зустрічі, побачення? ',
               'ні', 'ні', 'так'],
        ['38', 'Чи часто Ви бентежитеся, відчуваєте незручність при спілкуванні з малознайомими людьми? ',
               'так', 'ні', 'ні'],
        ['40', 'Чи правда, що Ви не дуже упевнено почуваєте себе в оточенні великої групи своїх товаришів? ',
               'ні', 'ні', 'так']
    ]

    description = "Таблица 1.3 – Результати організаторської уміння"

    report.add_table(description, data)

    report.append_text("""Проаналізувати отримані результати відповідно до отриманої оцінки. Підрахуємо кількість співпадаючих з ключем відповідей по кожному розділу методики. Обчислемо оцінні коефіцієнти окремо для комунікативних і організаторських здібностей за формулою: К = 0,05 * С, де: К - величина оцінного коефіцієнта; С - кількість співпадаючих з ключем відповідей.""")
    report.append_text("""Комунікативні здібності: 19/20, тобто K = 0,95/1, що значить "V - дуже високий рівень".""")
    report.append_text("""Організаторської уміння: 13/20, тобто K = 0,65/1, що значить "II - нижче середнього рівня".""")
    report._add_blank_line()




    # add_listings_of_all_files(report, lr_number, "src")
    # add_images_of_all_files(report, lr_number, "images")

    report.add_lab_conclusion("Висновок: навчився особистості виявляти комунікативні та організаторські схильності.")
    report.save()
    # report.append_to_existing("existing_report.docx")
